package Code;

public class Document {
	String head;
	public Document(String head) {
		// TODO Auto-generated constructor stub
		this.head=head;
	}
	@Override
	public String toString(){
		return "大区 " + head + '\n' +
			   "Name             Price" + '\n'
			 + "材料-无色小晶块  : " + '\n'
			 + "材料-白色小晶块  : " + '\n'
			 + "材料-黑色小晶块  : " + '\n'
			 + "材料-无色小晶块  : " + '\n'
			 + "材料-蓝色小晶块  : " + '\n'
			 + "材料-红色小晶块  : " + '\n'
			 + "材料-金色小晶块  : " + '\n'
			 + "材料-魔力结晶    : " + '\n'
			 + "材料-生命之息    : " + '\n'
			 + "材料-黄金粉末    : " + '\n'
			 + "材料-龙之心      : " + '\n'
			 + "材料-蓝色魔力产物: " + '\n'
			 + "材料-红色魔力产物: " + '\n'
			 + "材料-黑色魔力产物: " + '\n'
			 + "材料-白色魔力产物: " + '\n'
			 + "材料-无色魔力产物: " + '\n'
			 + "下面是消耗品        Price" + "需求量(日销量)"+  '\n'
			 + "消耗品-顶级生命灵药:"      + "需求量:"+         '\n'
			 + "消耗品-顶级力量灵药:"      + "需求量:"+         '\n'
			 + "消耗品-顶级魔力灵药:"      + "需求量:"+         '\n'
			 + "消耗品-顶级智力灵药:"      + "需求量:"+         '\n'
			 + "消耗品-神秘世界的玩具:"    + "需求量:"+         '\n'
			 + "消耗品-神圣祝福药水:"      + "需求量:"+         '\n'
			 + "消耗品-斗神之吼秘药:"      + "需求量:"+         '\n'
			 + "消耗品-瞬间移动药剂:"      + "需求量:"+         '\n';
	}
}
